Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/v2/Resources/ReversarTransaccion/wsdl/ReversarTransaccionPS.wsdl

<wsdl:definitions name="reversarTransaccionPS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/reversarTransaccionPS/" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/reversarTransaccionPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:cons="http://www.ficohsa.com.hn/middleware.services/reversarTransaccionTypes">

	<wsdl:types>
		<xsd:schema>
			<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
		</xsd:schema>
		<xsd:schema>
			<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/reversarTransaccionTypes" schemaLocation="../../../../Business_Resources/ReversarTransaccion/ReversarTransaccion/reversarTransaccionTypes.xsd"/>
		</xsd:schema>
	</wsdl:types>

	<wsdl:message name="reversarTransaccionRequest">
		<wsdl:part element="cons:reversarTransaccion" name="parameters"/>
		<wsdl:part name="RequestHeader" element="auth:RequestHeader"/>
	</wsdl:message>
	<wsdl:message name="reversarTransaccionResponse">
		<wsdl:part element="cons:reversarTransaccionResponse" name="result"/>
		<wsdl:part name="ResponseHeader" element="auth:ResponseHeader"/>
	</wsdl:message>

	<wsdl:portType name="reversarTransaccionPS">
		<wsdl:operation name="reversarTransaccion" parameterOrder="parameters RequestHeader ResponseHeader">
			<wsdl:input message="fic:reversarTransaccionRequest"/>
			<wsdl:output message="fic:reversarTransaccionResponse"/>
		</wsdl:operation>
	</wsdl:portType>

	<wsdl:binding name="reversarTransaccionPSSOAP" type="fic:reversarTransaccionPS">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="reversarTransaccion">
			<soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/reversarTransaccionPS/reversarTransaccion"/>
			<wsdl:input>
				<soap:body use="literal" parts="parameters"/>
				<soap:header message="fic:reversarTransaccionRequest" part="RequestHeader" use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" parts="result"/>
				<soap:header message="fic:reversarTransaccionResponse" part="ResponseHeader" use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>

	<wsdl:service name="reversarTransaccionPS">
		<wsdl:port binding="fic:reversarTransaccionPSSOAP" name="reversarTransaccionPSSOAP">
			<soap:address location="http://mwomnidesa:8003/Middleware/OperationsAndExecution/CustomerDeposits/ReversarTransaccion"/>
		</wsdl:port>
	</wsdl:service>

</wsdl:definitions>